#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```hcl
module.dns_tunnel.random_bytes.tunnel_secret["affine-mcp"]: Refreshing state...
module.zone_settings.cloudflare_zone_setting.always_use_https[0]: Refreshing state... [id=always_use_https]
module.dns_verification.cloudflare_dns_record.verification["api-hosting"]: Refreshing state... [id=553186b6054a3d1fa3ab34a7fc47af85]
module.dns_verification.cloudflare_dns_record.verification["dmarc-cloudflare"]: Refreshing state... [id=1b8a98af0e8251f55739467b376ab89f]
module.dns_verification.cloudflare_dns_record.verification["api-acme"]: Refreshing state... [id=c01bde349d63d3f689a367796e91ad6b]
module.dns_mail.cloudflare_dns_record.spf["spf"]: Refreshing state... [id=cf0b5da924f5af865f7449fbabcfe7f5]
module.api_worker.cloudflare_workers_script.api_proxy: Refreshing state... [id=api-proxy]
module.mcp_gateway.cloudflare_workers_script.mcp_gateway: Refreshing state... [id=mcp-gateway]
module.dns_tunnel.cloudflare_zero_trust_access_service_token.token["affine-mcp"]: Refreshing state... [id=cf208fa4-a3f7-4a86-bf15-5a0e4f339856]
module.dns_tunnel.cloudflare_zero_trust_access_policy.service_token["affine-mcp"]: Refreshing state... [id=7bec0761-db53-4241-88fd-3cd1f3efb13a]
module.dns_tunnel.cloudflare_zero_trust_access_policy.email["affine-mcp"]: Refreshing state... [id=7064c503-274e-4abf-95d4-5932b715e4e3]
module.zone_settings.cloudflare_ruleset.www_redirect[0]: Refreshing state... [id=03950d4caa5a47ee8a9a635ddf54d84d]
module.dns_web.cloudflare_dns_record.web["home"]: Refreshing state... [id=ef7e577ae43af8131275f2d2ed4c6c83]
module.dns_web.cloudflare_dns_record.web["admin"]: Refreshing state... [id=e3999beb8de1e600f95786095aa99d8c]
module.dns_web.cloudflare_dns_record.web["www"]: Refreshing state... [id=9c1cc6e7c730638371052242daa24f10]
module.dns_web.cloudflare_dns_record.web["fairview"]: Refreshing state... [id=754bf6c9169f6fffe66b28fe6107c808]
module.dns_web.cloudflare_dns_record.web["root"]: Refreshing state... [id=d283453db7503a30f34b0e1109f9074e]
module.dns_web.cloudflare_dns_record.web["dev"]: Refreshing state... [id=21c645c916085b58b79798ee3ba5a867]
module.dns_web.cloudflare_dns_record.web["domainconnect"]: Refreshing state... [id=8c2dc3c5948ccc6e863647501ded8de1]
module.dns_web.cloudflare_dns_record.web["auth"]: Refreshing state... [id=afb539069d3c6210fd64ac172ea17c4e]
module.dns_mail.cloudflare_dns_record.dmarc["dmarc"]: Refreshing state... [id=1a5c6917ff3be5cb90282c4282f07e89]
module.dns_mail.cloudflare_dns_record.mx["2"]: Refreshing state... [id=3fdbc5e38335d5ea438bdf8a71a0244d]
module.api_worker.cloudflare_dns_record.api: Refreshing state... [id=36aec8e6778a6b469c85017d19ac6569]
module.dns_mail.cloudflare_dns_record.mx["3"]: Refreshing state... [id=2a838bf3ca519420d4ab5a1ab08c7c44]
module.dns_mail.cloudflare_dns_record.mx["4"]: Refreshing state... [id=d3f54992c7ca80f30c2ce65bd432a351]
module.dns_mail.cloudflare_dns_record.mx["0"]: Refreshing state... [id=ef829d65332fac7acbb900193e6bd377]
module.mcp_gateway.cloudflare_dns_record.mcp_gateway: Refreshing state... [id=82edf758a2003d57b9a86ba55580afd3]
module.dns_mail.cloudflare_dns_record.mx["1"]: Refreshing state... [id=e38d60e026b6dbc6b782a2ef1105c4c4]
module.dns_mail.cloudflare_dns_record.dkim["dkim"]: Refreshing state... [id=6553784b4785438207cb4f2462096f6e]
module.dns_tunnel.cloudflare_zero_trust_tunnel_cloudflared.tunnel["affine-mcp"]: Refreshing state... [id=2036e716-b9da-49d0-aa25-cfdbd58ce4f9]
module.dns_tunnel.cloudflare_zero_trust_access_application.app["affine-mcp"]: Refreshing state... [id=dd7c2d4d-1a2e-4c68-bc65-1044374cb2fc]
module.dns_tunnel.cloudflare_dns_record.tunnel_cname["affine-mcp"]: Refreshing state... [id=48517662f0c14e80d369f5b017fa8411]
module.dns_tunnel.cloudflare_zero_trust_tunnel_cloudflared_config.config["affine-mcp"]: Refreshing state... [id=2036e716-b9da-49d0-aa25-cfdbd58ce4f9]
module.mcp_gateway.cloudflare_workers_route.mcp_gateway: Refreshing state... [id=a0bb02528b8a4f3b8747244a539f49d2]
module.api_worker.cloudflare_workers_route.api: Refreshing state... [id=8500fcfb04bc4a8eb9368e9cafc7bfd6]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  ~ update in-place
  - destroy

Terraform will perform the following actions:

  # module.api_worker.cloudflare_workers_script.api_proxy will be updated in-place
  ~ resource "cloudflare_workers_script" "api_proxy" {
      ~ compatibility_flags = [] -> (known after apply)
      ~ content             = <<-EOT
          - export default {
          + export default {
          -   async fetch(request, env) {
          +   async fetch(request, env) {
          -     const url = new URL(request.url);
          +     const url = new URL(request.url);
          - 
          + 
          -     const ALLOWED_ORIGINS = [
          +     const ALLOWED_ORIGINS = [
          -       "https://briananderson.xyz",
          +       "https://briananderson.xyz",
          -       "https://www.briananderson.xyz",
          +       "https://www.briananderson.xyz",
          -       "https://dev.briananderson.xyz",
          +       "https://dev.briananderson.xyz",
          -     ];
          +     ];
          - 
          + 
          -     const origin = request.headers.get("Origin");
          +     const origin = request.headers.get("Origin");
          -     const allowOrigin = ALLOWED_ORIGINS.includes(origin)
          +     const allowOrigin = ALLOWED_ORIGINS.includes(origin)
          -       ? origin
          +       ? origin
          -       : ALLOWED_ORIGINS[0];
          +       : ALLOWED_ORIGINS[0];
          - 
          + 
          -     const corsHeaders = {
          +     const corsHeaders = {
          -       "Access-Control-Allow-Origin": allowOrigin,
          +       "Access-Control-Allow-Origin": allowOrigin,
          -       "Access-Control-Allow-Methods": "GET, POST, OPTIONS",
          +       "Access-Control-Allow-Methods": "GET, POST, OPTIONS",
          -       "Access-Control-Allow-Headers": "Content-Type",
          +       "Access-Control-Allow-Headers": "Content-Type",
          -       "Access-Control-Max-Age": "86400",
          +       "Access-Control-Max-Age": "86400",
          -     };
          +     };
          - 
          + 
          -     // CORS preflight
          +     // CORS preflight
          -     if (request.method === "OPTIONS") {
          +     if (request.method === "OPTIONS") {
          -       return new Response(null, { status: 204, headers: corsHeaders });
          +       return new Response(null, { status: 204, headers: corsHeaders });
          -     }
          +     }
          - 
          + 
          -     const routes = {
          +     const routes = {
          -       "/chat": env.CHAT_URL,
          +       "/chat": env.CHAT_URL,
          -       "/fit-finder": env.FIT_FINDER_URL,
          +       "/fit-finder": env.FIT_FINDER_URL,
          -     };
          +     };
          - 
          + 
          -     const target = routes[url.pathname];
          +     const target = routes[url.pathname];
          -     if (!target) {
          +     if (!target) {
          -       return new Response(JSON.stringify({ error: "Not found" }), {
          +       return new Response(JSON.stringify({ error: "Not found" }), {
          -         status: 404,
          +         status: 404,
          -         headers: { "Content-Type": "application/json", ...corsHeaders },
          +         headers: { "Content-Type": "application/json", ...corsHeaders },
          -       });
          +       });
          -     }
          +     }
          - 
          + 
          -     // Forward request to Cloud Run
          +     // Forward request to Cloud Run
          -     const response = await fetch(target, {
          +     const response = await fetch(target, {
          -       method: request.method,
          +       method: request.method,
          -       headers: { "Content-Type": request.headers.get("Content-Type") || "application/json" },
          +       headers: { "Content-Type": request.headers.get("Content-Type") || "application/json" },
          -       body: request.method !== "GET" ? request.body : undefined,
          +       body: request.method !== "GET" ? request.body : undefined,
          -     });
          +     });
          - 
          + 
          -     // Return response with CORS headers
          +     // Return response with CORS headers
          -     const newResponse = new Response(response.body, response);
          +     const newResponse = new Response(response.body, response);
          -     newResponse.headers.set("Access-Control-Allow-Origin", allowOrigin);
          +     newResponse.headers.set("Access-Control-Allow-Origin", allowOrigin);
          -     return newResponse;
          +     return newResponse;
          -   },
          +   },
            };
        EOT
      ~ etag                = "9c27e5e71c516189b80e528e174d700ee92dbabccb627dbc017bc9f89507777f" -> (known after apply)
      ~ handlers            = [
          - "fetch",
        ] -> (known after apply)
      ~ has_assets          = false -> (known after apply)
      ~ has_modules         = true -> (known after apply)
        id                  = "api-proxy"
      ~ last_deployed_from  = "terraform" -> (known after apply)
      + migration_tag       = (known after apply)
      ~ modified_on         = "2026-02-14T22:23:16Z" -> (known after apply)
      + named_handlers      = (known after apply)
      + placement           = (known after apply)
      + placement_mode      = (known after apply)
      + placement_status    = (known after apply)
      ~ startup_time_ms     = 0 -> (known after apply)
      ~ tail_consumers      = [] -> (known after apply)
        # (8 unchanged attributes hidden)
    }

  # module.dns_tunnel.cloudflare_dns_record.tunnel_cname["affine-mcp"] will be destroyed
  # (because key ["affine-mcp"] is not in for_each map)
  - resource "cloudflare_dns_record" "tunnel_cname" {
      - content     = "2036e716-b9da-49d0-aa25-cfdbd58ce4f9.cfargotunnel.com" -> null
      - created_on  = "2026-02-14T22:23:17Z" -> null
      - id          = "48517662f0c14e80d369f5b017fa8411" -> null
      - meta        = jsonencode({})
      - modified_on = "2026-02-14T22:23:17Z" -> null
      - name        = "affine-mcp.briananderson.xyz" -> null
      - proxiable   = true -> null
      - proxied     = true -> null
      - settings    = {
          - flatten_cname = false -> null
        } -> null
      - tags        = [] -> null
      - ttl         = 1 -> null
      - type        = "CNAME" -> null
      - zone_id     = "806c2f971876ec222cf0a28bca4bd9a9" -> null
    }

  # module.dns_tunnel.cloudflare_zero_trust_access_application.app["affine-mcp"] will be destroyed
  # (because key ["affine-mcp"] is not in for_each map)
  - resource "cloudflare_zero_trust_access_application" "app" {
      - account_id                 = "c83c77a9f77705285912f49f14897e6b" -> null
      - app_launcher_visible       = false -> null
      - aud                        = "49a7035a21b5fa346b677314b7e1d5ed28729a89e6ecddadb7901855c150de22" -> null
      - destinations               = [
          - {
              - type = "public" -> null
              - uri  = "affine-mcp.briananderson.xyz" -> null
            },
        ] -> null
      - domain                     = "affine-mcp.briananderson.xyz" -> null
      - http_only_cookie_attribute = true -> null
      - id                         = "dd7c2d4d-1a2e-4c68-bc65-1044374cb2fc" -> null
      - name                       = "affine-mcp" -> null
      - policies                   = [
          - {
              - id         = "7bec0761-db53-4241-88fd-3cd1f3efb13a" -> null
              - precedence = 1 -> null
            },
          - {
              - id         = "7064c503-274e-4abf-95d4-5932b715e4e3" -> null
              - precedence = 2 -> null
            },
        ] -> null
      - self_hosted_domains        = [
          - "affine-mcp.briananderson.xyz",
        ] -> null
      - service_auth_401_redirect  = true -> null
      - session_duration           = "24h" -> null
      - skip_interstitial          = true -> null
      - type                       = "self_hosted" -> null
    }

  # module.dns_tunnel.cloudflare_zero_trust_access_policy.email["affine-mcp"] will be destroyed
  # (because key ["affine-mcp"] is not in for_each map)
  - resource "cloudflare_zero_trust_access_policy" "email" {
      - account_id       = "c83c77a9f77705285912f49f14897e6b" -> null
      - decision         = "allow" -> null
      - id               = "7064c503-274e-4abf-95d4-5932b715e4e3" -> null
      - include          = [
          - {
              - email = {
                  - email = "brian@briananderson.xyz" -> null
                } -> null
            },
        ] -> null
      - name             = "Allow emails for affine-mcp" -> null
      - session_duration = "24h" -> null
    }

  # module.dns_tunnel.cloudflare_zero_trust_access_policy.service_token["affine-mcp"] will be destroyed
  # (because key ["affine-mcp"] is not in for_each map)
  - resource "cloudflare_zero_trust_access_policy" "service_token" {
      - account_id       = "c83c77a9f77705285912f49f14897e6b" -> null
      - decision         = "non_identity" -> null
      - id               = "7bec0761-db53-4241-88fd-3cd1f3efb13a" -> null
      - include          = [
          - {
              - any_valid_service_token = {} -> null
            },
        ] -> null
      - name             = "Allow affine-mcp-ai-clients" -> null
      - session_duration = "24h" -> null
    }

  # module.dns_tunnel.cloudflare_zero_trust_access_service_token.token["affine-mcp"] will be destroyed
  # (because key ["affine-mcp"] is not in for_each map)
  - resource "cloudflare_zero_trust_access_service_token" "token" {
      - account_id            = "c83c77a9f77705285912f49f14897e6b" -> null
      - client_id             = "56a3fdf119def831b1bd48230f9469aa.access" -> null
      - client_secret         = (sensitive value) -> null
      - client_secret_version = 1 -> null
      - duration              = "8760h" -> null
      - expires_at            = "2027-02-14T22:27:09Z" -> null
      - id                    = "cf208fa4-a3f7-4a86-bf15-5a0e4f339856" -> null
      - name                  = "affine-mcp-ai-clients" -> null
    }

  # module.dns_tunnel.cloudflare_zero_trust_tunnel_cloudflared.tunnel["affine-mcp"] will be destroyed
  # (because key ["affine-mcp"] is not in for_each map)
  - resource "cloudflare_zero_trust_tunnel_cloudflared" "tunnel" {
      - account_id      = "c83c77a9f77705285912f49f14897e6b" -> null
      - account_tag     = "c83c77a9f77705285912f49f14897e6b" -> null
      - config_src      = "cloudflare" -> null
      - connections     = [
          - {
              - client_id            = "c2222db8-433d-4b19-8be6-0cff7001b390" -> null
              - client_version       = "2026.2.0" -> null
              - colo_name            = "den01" -> null
              - id                   = "d5e503c2-ab2f-4315-a2a5-e57801bee03f" -> null
              - is_pending_reconnect = false -> null
              - opened_at            = "2026-02-14T22:48:56Z" -> null
              - origin_ip            = "174.16.110.174" -> null
              - uuid                 = "d5e503c2-ab2f-4315-a2a5-e57801bee03f" -> null
            },
          - {
              - client_id            = "c2222db8-433d-4b19-8be6-0cff7001b390" -> null
              - client_version       = "2026.2.0" -> null
              - colo_name            = "mci01" -> null
              - id                   = "506fdfc6-e16b-4ce7-ad25-c7f7b439c42a" -> null
              - is_pending_reconnect = false -> null
              - opened_at            = "2026-02-14T22:48:56Z" -> null
              - origin_ip            = "174.16.110.174" -> null
              - uuid                 = "506fdfc6-e16b-4ce7-ad25-c7f7b439c42a" -> null
            },
          - {
              - client_id            = "c2222db8-433d-4b19-8be6-0cff7001b390" -> null
              - client_version       = "2026.2.0" -> null
              - colo_name            = "den01" -> null
              - id                   = "f8fed5e3-cd64-4f2f-969b-d22a4eadc64e" -> null
              - is_pending_reconnect = false -> null
              - opened_at            = "2026-02-14T22:48:57Z" -> null
              - origin_ip            = "174.16.110.174" -> null
              - uuid                 = "f8fed5e3-cd64-4f2f-969b-d22a4eadc64e" -> null
            },
          - {
              - client_id            = "c2222db8-433d-4b19-8be6-0cff7001b390" -> null
              - client_version       = "2026.2.0" -> null
              - colo_name            = "mci01" -> null
              - id                   = "9cd081b0-c03b-441d-b451-9ec21ead4625" -> null
              - is_pending_reconnect = false -> null
              - opened_at            = "2026-02-14T22:48:58Z" -> null
              - origin_ip            = "174.16.110.174" -> null
              - uuid                 = "9cd081b0-c03b-441d-b451-9ec21ead4625" -> null
            },
        ] -> null
      - conns_active_at = "2026-02-14T22:48:56Z" -> null
      - created_at      = "2026-02-14T22:23:16Z" -> null
      - id              = "2036e716-b9da-49d0-aa25-cfdbd58ce4f9" -> null
      - metadata        = jsonencode({})
      - name            = "affine-mcp" -> null
      - remote_config   = true -> null
      - status          = "healthy" -> null
      - tun_type        = "cfd_tunnel" -> null
      - tunnel_secret   = (sensitive value) -> null
    }

  # module.dns_tunnel.cloudflare_zero_trust_tunnel_cloudflared_config.config["affine-mcp"] will be destroyed
  # (because key ["affine-mcp"] is not in for_each map)
  - resource "cloudflare_zero_trust_tunnel_cloudflared_config" "config" {
      - account_id = "c83c77a9f77705285912f49f14897e6b" -> null
      - config     = {
          - ingress = [
              - {
                  - hostname = "affine-mcp.briananderson.xyz" -> null
                  - service  = "http://affine_mcp_server:8080" -> null
                },
              - {
                  - service = "http_status:404" -> null
                },
            ] -> null
        } -> null
      - created_at = "2026-02-14T22:55:30Z" -> null
      - id         = "2036e716-b9da-49d0-aa25-cfdbd58ce4f9" -> null
      - source     = "cloudflare" -> null
      - tunnel_id  = "2036e716-b9da-49d0-aa25-cfdbd58ce4f9" -> null
      - version    = 3 -> null
    }

  # module.dns_tunnel.random_bytes.tunnel_secret["affine-mcp"] will be destroyed
  # (because key ["affine-mcp"] is not in for_each map)
  - resource "random_bytes" "tunnel_secret" {
      - base64 = (sensitive value) -> null
      - hex    = (sensitive value) -> null
      - length = 32 -> null
    }

  # module.dns_web.cloudflare_dns_record.web["auth"] will be updated in-place
  ~ resource "cloudflare_dns_record" "web" {
      + comment     = ""
        id          = "afb539069d3c6210fd64ac172ea17c4e"
      ~ modified_on = "2026-02-15T02:48:37Z" -> (known after apply)
        name        = "auth.briananderson.xyz"
        tags        = []
        # (9 unchanged attributes hidden)
    }

  # module.dns_web.cloudflare_dns_record.web["domainconnect"] will be updated in-place
  ~ resource "cloudflare_dns_record" "web" {
      + comment     = ""
        id          = "8c2dc3c5948ccc6e863647501ded8de1"
      ~ modified_on = "2026-02-15T02:48:37Z" -> (known after apply)
        name        = "_domainconnect.briananderson.xyz"
        tags        = []
        # (9 unchanged attributes hidden)
    }

  # module.dns_web.cloudflare_dns_record.web["fairview"] will be updated in-place
  ~ resource "cloudflare_dns_record" "web" {
      + comment     = ""
        id          = "754bf6c9169f6fffe66b28fe6107c808"
      ~ modified_on = "2026-01-22T15:43:43Z" -> (known after apply)
        name        = "fairview.briananderson.xyz"
        tags        = []
        # (9 unchanged attributes hidden)
    }

  # module.mcp_gateway.cloudflare_workers_script.mcp_gateway will be updated in-place
  ~ resource "cloudflare_workers_script" "mcp_gateway" {
      ~ bindings            = [
          ~ {
                name = "ROUTES"
              ~ text = (sensitive value)
                # (1 unchanged attribute hidden)
            },
            # (1 unchanged element hidden)
        ]
      ~ compatibility_flags = [] -> (known after apply)
      ~ etag                = "94c603855465d3d64d78febbdaf5e654519e8edf2488ea559bf2ffb840a3bcc0" -> (known after apply)
      ~ handlers            = [
          - "fetch",
        ] -> (known after apply)
      ~ has_assets          = false -> (known after apply)
      ~ has_modules         = true -> (known after apply)
        id                  = "mcp-gateway"
      ~ last_deployed_from  = "terraform" -> (known after apply)
      + migration_tag       = (known after apply)
      ~ modified_on         = "2026-02-15T02:48:37Z" -> (known after apply)
      + named_handlers      = (known after apply)
      + placement           = (known after apply)
      + placement_mode      = (known after apply)
      + placement_status    = (known after apply)
      ~ startup_time_ms     = 0 -> (known after apply)
      ~ tail_consumers      = [] -> (known after apply)
        # (8 unchanged attributes hidden)
    }

Plan: 0 to add, 5 to change, 8 to destroy.

Changes to Outputs:
  ~ service_token_credentials = (sensitive value)
  ~ tunnel_cnames             = {
      - affine-mcp = "affine-mcp.briananderson.xyz"
    }
  ~ tunnel_ids                = {
      - affine-mcp = "2036e716-b9da-49d0-aa25-cfdbd58ce4f9"
    }
  ~ tunnel_info               = {
      - affine-mcp = {
          - id     = "2036e716-b9da-49d0-aa25-cfdbd58ce4f9"
          - status = "healthy"
        }
    }

Warning: Resource Destruction Considerations

  with module.dns_tunnel.cloudflare_zero_trust_tunnel_cloudflared_config.config["affine-mcp"],
  on modules/dns_tunnel/main.tf line 32, in resource "cloudflare_zero_trust_tunnel_cloudflared_config" "config":
  32: resource "cloudflare_zero_trust_tunnel_cloudflared_config" "config" {

Applying this resource destruction will remove the resource from the
Terraform state but will not change it in the API. If you would like to
destroy or reset this resource in the API, refer to the documentation for how
to do it manually.

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: tfplan

To perform exactly these actions, run the following command to apply:
    terraform apply "tfplan"

```

</details>

*Pusher: @briananderson1222, Action: `pull_request`, Workflow: `Terraform`*